In [1]:
import numpy as np 
import pandas as pd

# Importing data

In [2]:
dataset = pd.read_csv('Data.csv')
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain   NaN  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0      NaN        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France   NaN  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0      NaN       Yes

In [3]:
x = dataset.iloc[:,:-1].values
y = dataset.iloc[:,-1].values
x

array([['France', 44.0, 72000.0],
       ['Spain', nan, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, nan],
       ['Germany', 40.0, nan],
       ['France', 35.0, 58000.0],
       ['Spain', nan, 52000.0],
       ['France', nan, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, nan]], dtype=object)

In [4]:
y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
      dtype=object)

In [5]:
dataset.isnull().sum()

Country      0
Age          3
Salary       3
Purchased    0
dtype: int64

In [6]:
 from sklearn.impute import SimpleImputer

# Applying Simple Imputer

In [7]:
imputer = SimpleImputer(missing_values= np.nan, strategy='mean')

In [8]:
imputer.fit(x[:,1:3])

SimpleImputer()

In [9]:
x[:,1:3] = imputer.transform(x[:,1:3])

In [10]:
print(x)

[['France' 44.0 72000.0]
 ['Spain' 39.142857142857146 48000.0]
 ['Germany' 30.0 54000.0]
 ['Spain' 38.0 63714.28571428572]
 ['Germany' 40.0 63714.28571428572]
 ['France' 35.0 58000.0]
 ['Spain' 39.142857142857146 52000.0]
 ['France' 39.142857142857146 79000.0]
 ['Germany' 50.0 83000.0]
 ['France' 37.0 63714.28571428572]]

In [11]:
dataset = pd.read_csv('Data.csv')
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain   NaN  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0      NaN        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France   NaN  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0      NaN       Yes

# Handling categorical Data

# DATA PRE-PROCESSING - LABLEL ENCODER

In [12]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [13]:
salary_class = pd.DataFrame({'Salary':[5000,84000,22000,8000,75000],'Class':['Low','High','Medium','Low','High']})

In [14]:
salary_class

   Salary   Class
0    5000     Low
1   84000    High
2   22000  Medium
3    8000     Low
4   75000    High

In [16]:
lab_encode = LabelEncoder()

In [17]:
salary_class['Class'] = lab_encode.fit_transform(salary_class['Class'])
salary_class

   Salary  Class
0    5000      1
1   84000      0
2   22000      2
3    8000      1
4   75000      0

# ORDINAL ENCODER

In [18]:
import pandas as pd
import numpy as np

In [19]:
wages = pd.DataFrame({'Salary':[5000,84000,22000,8000,75000],'Class':['Low','High','Medium','Low','High']})

# unique

In [22]:
wages.Class.unique()

array(['Low', 'High', 'Medium'], dtype=object)

In [23]:
order = ['Low','Medium','High']

In [24]:
wages

   Salary   Class
0    5000     Low
1   84000    High
2   22000  Medium
3    8000     Low
4   75000    High

In [27]:
from sklearn.preprocessing import OrdinalEncoder

In [28]:
ord_enc = OrdinalEncoder(categories=[order])

In [29]:
ord_enc

OrdinalEncoder(categories=[['Low', 'Medium', 'High']])

In [30]:
ord_enc.fit(wages[["Class"]])

OrdinalEncoder(categories=[['Low', 'Medium', 'High']])

# Transforming The Encoder

In [32]:
wages["Class"]= ord_enc.transform(wages[["Class"]])

In [33]:
wages

   Salary  Class
0    5000    0.0
1   84000    2.0
2   22000    1.0
3    8000    0.0
4   75000    2.0